input: "data"
input_shape {
  dim: 1
  dim: 3
  dim: 224  
  dim:224
}

input: "im_info"
input_shape {
  dim: 1
  dim: 3
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  convolution_param {
    num_output: 96
    pad: 3
    kernel_size: 7
    stride: 2
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "norm1"
  type: "LRN"
  bottom: "conv1"
  top: "norm1"
  lrn_param {
    local_size: 3
    alpha: 5e-05
    beta: 0.75
    norm_region: WITHIN_CHANNEL
    engine: CAFFE
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "norm1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 1
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    stride: 2
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "norm2"
  type: "LRN"
  bottom: "conv2"
  top: "norm2"
  lrn_param {
    local_size: 3
    alpha: 5e-05
    beta: 0.75
    norm_region: WITHIN_CHANNEL
    engine: CAFFE
  }
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "norm2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 1
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "conv4"
  top: "conv5"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}
layer {
  name: "rpn_conv/3x3"
  type: "Convolution"
  bottom: "conv5"
  top: "rpn_conv/3x3"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "rpn_relu/3x3"
  type: "ReLU"
  bottom: "rpn_conv/3x3"
  top: "rpn_conv/3x3"
}
layer {
  name: "rpn_cls_score"
  type: "Convolution"
  bottom: "rpn_conv/3x3"
  top: "rpn_cls_score"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  convolution_param {
    num_output: 18
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "rpn_bbox_pred"
  type: "Convolution"
  bottom: "rpn_conv/3x3"
  top: "rpn_bbox_pred"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  convolution_param {
    num_output: 36
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "rpn_cls_score_reshape"
  type: "Reshape"
  bottom: "rpn_cls_score"
  top: "rpn_cls_score_reshape"
  reshape_param {
    shape {
      dim: 0
      dim: 2
      dim: -1
      dim: 0
    }
  }
}
layer {
  name: "rpn_cls_prob"
  type: "Softmax"
  bottom: "rpn_cls_score_reshape"
  top: "rpn_cls_prob"
}
layer {
  name: "rpn_cls_prob_reshape"
  type: "Reshape"
  bottom: "rpn_cls_prob"
  top: "rpn_cls_prob_reshape"
  reshape_param {
    shape {
      dim: 0
      dim: 18
      dim: -1
      dim: 0
    }
  }
}
layer {
  name: "proposal"
  type: "Python"
  bottom: "rpn_cls_prob_reshape"
  bottom: "rpn_bbox_pred"
  bottom: "im_info"
  top: "rois"
  python_param {
    module: "rpn.proposal_layer"
    layer: "ProposalLayer"
    param_str: "\'feat_stride\': 16"
  }
}
layer {
  name: "roi_pool_conv5"
  type: "ROIPooling"
  bottom: "conv5"
  bottom: "rois"
  top: "roi_pool_conv5"
  roi_pooling_param {
    pooled_h: 6
    pooled_w: 6
    spatial_scale: 0.0625
  }
}
layer {
  name: "fc6"
  type: "InnerProduct"
  bottom: "roi_pool_conv5"
  top: "fc6"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4096
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "drop6"
  type: "Dropout"
  bottom: "fc6"
  top: "fc6"
  dropout_param {
    dropout_ratio: 0.5
    scale_train: false
  }
}
layer {
  name: "fc7"
  type: "InnerProduct"
  bottom: "fc6"
  top: "fc7"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4096
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "fc7"
  top: "fc7"
}
layer {
  name: "drop7"
  type: "Dropout"
  bottom: "fc7"
  top: "fc7"
  dropout_param {
    dropout_ratio: 0.5
    scale_train: false
  }
}
layer {
  name: "bbox_pred"
  type: "InnerProduct"
  bottom: "fc7"
  top: "bbox_pred"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 1140
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_score_0"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_0"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_0"
  type: "Softmax"
  bottom: "cls_score_0"
  top: "cls_prob_0"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_1"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_1"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_1"
  type: "Softmax"
  bottom: "cls_score_1"
  top: "cls_prob_1"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_3"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_3"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_3"
  type: "Softmax"
  bottom: "cls_score_3"
  top: "cls_prob_3"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_4"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_4"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_4"
  type: "Softmax"
  bottom: "cls_score_4"
  top: "cls_prob_4"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_5"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_5"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_5"
  type: "Softmax"
  bottom: "cls_score_5"
  top: "cls_prob_5"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_6"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_6"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_6"
  type: "Softmax"
  bottom: "cls_score_6"
  top: "cls_prob_6"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_7"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_7"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_7"
  type: "Softmax"
  bottom: "cls_score_7"
  top: "cls_prob_7"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_8"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_8"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_8"
  type: "Softmax"
  bottom: "cls_score_8"
  top: "cls_prob_8"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_9"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_9"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_9"
  type: "Softmax"
  bottom: "cls_score_9"
  top: "cls_prob_9"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_10"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_10"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 7
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_10"
  type: "Softmax"
  bottom: "cls_score_10"
  top: "cls_prob_10"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_11"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_11"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 5
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_11"
  type: "Softmax"
  bottom: "cls_score_11"
  top: "cls_prob_11"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_15"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_15"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_15"
  type: "Softmax"
  bottom: "cls_score_15"
  top: "cls_prob_15"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_16"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_16"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 7
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_16"
  type: "Softmax"
  bottom: "cls_score_16"
  top: "cls_prob_16"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_17"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_17"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_17"
  type: "Softmax"
  bottom: "cls_score_17"
  top: "cls_prob_17"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_18"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_18"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_18"
  type: "Softmax"
  bottom: "cls_score_18"
  top: "cls_prob_18"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_21"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_21"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_21"
  type: "Softmax"
  bottom: "cls_score_21"
  top: "cls_prob_21"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_32"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_32"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_32"
  type: "Softmax"
  bottom: "cls_score_32"
  top: "cls_prob_32"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_33"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_33"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_33"
  type: "Softmax"
  bottom: "cls_score_33"
  top: "cls_prob_33"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_34"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_34"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 13
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_34"
  type: "Softmax"
  bottom: "cls_score_34"
  top: "cls_prob_34"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_35"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_35"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_35"
  type: "Softmax"
  bottom: "cls_score_35"
  top: "cls_prob_35"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_36"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_36"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_36"
  type: "Softmax"
  bottom: "cls_score_36"
  top: "cls_prob_36"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_37"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_37"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_37"
  type: "Softmax"
  bottom: "cls_score_37"
  top: "cls_prob_37"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_38"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_38"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 6
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_38"
  type: "Softmax"
  bottom: "cls_score_38"
  top: "cls_prob_38"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_39"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_39"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 6
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_39"
  type: "Softmax"
  bottom: "cls_score_39"
  top: "cls_prob_39"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_40"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_40"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 8
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_40"
  type: "Softmax"
  bottom: "cls_score_40"
  top: "cls_prob_40"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_43"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_43"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 5
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_43"
  type: "Softmax"
  bottom: "cls_score_43"
  top: "cls_prob_43"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_44"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_44"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_44"
  type: "Softmax"
  bottom: "cls_score_44"
  top: "cls_prob_44"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_47"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_47"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 5
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_47"
  type: "Softmax"
  bottom: "cls_score_47"
  top: "cls_prob_47"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_48"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_48"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_48"
  type: "Softmax"
  bottom: "cls_score_48"
  top: "cls_prob_48"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_50"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_50"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_50"
  type: "Softmax"
  bottom: "cls_score_50"
  top: "cls_prob_50"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_53"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_53"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_53"
  type: "Softmax"
  bottom: "cls_score_53"
  top: "cls_prob_53"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_61"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_61"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_61"
  type: "Softmax"
  bottom: "cls_score_61"
  top: "cls_prob_61"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_63"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_63"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_63"
  type: "Softmax"
  bottom: "cls_score_63"
  top: "cls_prob_63"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_65"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_65"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_65"
  type: "Softmax"
  bottom: "cls_score_65"
  top: "cls_prob_65"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_66"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_66"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_66"
  type: "Softmax"
  bottom: "cls_score_66"
  top: "cls_prob_66"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_67"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_67"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_67"
  type: "Softmax"
  bottom: "cls_score_67"
  top: "cls_prob_67"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_68"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_68"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_68"
  type: "Softmax"
  bottom: "cls_score_68"
  top: "cls_prob_68"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_69"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_69"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_69"
  type: "Softmax"
  bottom: "cls_score_69"
  top: "cls_prob_69"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_72"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_72"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_72"
  type: "Softmax"
  bottom: "cls_score_72"
  top: "cls_prob_72"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_76"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_76"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_76"
  type: "Softmax"
  bottom: "cls_score_76"
  top: "cls_prob_76"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_80"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_80"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_80"
  type: "Softmax"
  bottom: "cls_score_80"
  top: "cls_prob_80"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_81"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_81"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_81"
  type: "Softmax"
  bottom: "cls_score_81"
  top: "cls_prob_81"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_86"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_86"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 5
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_86"
  type: "Softmax"
  bottom: "cls_score_86"
  top: "cls_prob_86"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_90"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_90"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_90"
  type: "Softmax"
  bottom: "cls_score_90"
  top: "cls_prob_90"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_93"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_93"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_93"
  type: "Softmax"
  bottom: "cls_score_93"
  top: "cls_prob_93"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_95"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_95"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_95"
  type: "Softmax"
  bottom: "cls_score_95"
  top: "cls_prob_95"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_96"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_96"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_96"
  type: "Softmax"
  bottom: "cls_score_96"
  top: "cls_prob_96"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_98"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_98"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_98"
  type: "Softmax"
  bottom: "cls_score_98"
  top: "cls_prob_98"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_100"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_100"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_100"
  type: "Softmax"
  bottom: "cls_score_100"
  top: "cls_prob_100"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_104"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_104"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_104"
  type: "Softmax"
  bottom: "cls_score_104"
  top: "cls_prob_104"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_107"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_107"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_107"
  type: "Softmax"
  bottom: "cls_score_107"
  top: "cls_prob_107"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_111"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_111"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_111"
  type: "Softmax"
  bottom: "cls_score_111"
  top: "cls_prob_111"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_113"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_113"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_113"
  type: "Softmax"
  bottom: "cls_score_113"
  top: "cls_prob_113"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_114"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_114"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_114"
  type: "Softmax"
  bottom: "cls_score_114"
  top: "cls_prob_114"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_115"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_115"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_115"
  type: "Softmax"
  bottom: "cls_score_115"
  top: "cls_prob_115"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_116"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_116"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_116"
  type: "Softmax"
  bottom: "cls_score_116"
  top: "cls_prob_116"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_117"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_117"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_117"
  type: "Softmax"
  bottom: "cls_score_117"
  top: "cls_prob_117"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_118"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_118"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_118"
  type: "Softmax"
  bottom: "cls_score_118"
  top: "cls_prob_118"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_120"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_120"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_120"
  type: "Softmax"
  bottom: "cls_score_120"
  top: "cls_prob_120"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_124"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_124"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_124"
  type: "Softmax"
  bottom: "cls_score_124"
  top: "cls_prob_124"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_125"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_125"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_125"
  type: "Softmax"
  bottom: "cls_score_125"
  top: "cls_prob_125"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_139"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_139"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_139"
  type: "Softmax"
  bottom: "cls_score_139"
  top: "cls_prob_139"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_142"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_142"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_142"
  type: "Softmax"
  bottom: "cls_score_142"
  top: "cls_prob_142"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_150"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_150"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_150"
  type: "Softmax"
  bottom: "cls_score_150"
  top: "cls_prob_150"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_151"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_151"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_151"
  type: "Softmax"
  bottom: "cls_score_151"
  top: "cls_prob_151"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_154"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_154"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_154"
  type: "Softmax"
  bottom: "cls_score_154"
  top: "cls_prob_154"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_164"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_164"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_164"
  type: "Softmax"
  bottom: "cls_score_164"
  top: "cls_prob_164"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_168"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_168"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 8
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_168"
  type: "Softmax"
  bottom: "cls_score_168"
  top: "cls_prob_168"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_169"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_169"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_169"
  type: "Softmax"
  bottom: "cls_score_169"
  top: "cls_prob_169"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_170"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_170"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_170"
  type: "Softmax"
  bottom: "cls_score_170"
  top: "cls_prob_170"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_172"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_172"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_172"
  type: "Softmax"
  bottom: "cls_score_172"
  top: "cls_prob_172"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_185"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_185"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_185"
  type: "Softmax"
  bottom: "cls_score_185"
  top: "cls_prob_185"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_186"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_186"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_186"
  type: "Softmax"
  bottom: "cls_score_186"
  top: "cls_prob_186"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_192"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_192"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_192"
  type: "Softmax"
  bottom: "cls_score_192"
  top: "cls_prob_192"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_204"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_204"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_204"
  type: "Softmax"
  bottom: "cls_score_204"
  top: "cls_prob_204"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_214"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_214"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_214"
  type: "Softmax"
  bottom: "cls_score_214"
  top: "cls_prob_214"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_222"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_222"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 5
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_222"
  type: "Softmax"
  bottom: "cls_score_222"
  top: "cls_prob_222"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_224"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_224"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_224"
  type: "Softmax"
  bottom: "cls_score_224"
  top: "cls_prob_224"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_225"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_225"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_225"
  type: "Softmax"
  bottom: "cls_score_225"
  top: "cls_prob_225"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_226"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_226"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_226"
  type: "Softmax"
  bottom: "cls_score_226"
  top: "cls_prob_226"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_232"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_232"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_232"
  type: "Softmax"
  bottom: "cls_score_232"
  top: "cls_prob_232"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_236"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_236"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_236"
  type: "Softmax"
  bottom: "cls_score_236"
  top: "cls_prob_236"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_242"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_242"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_242"
  type: "Softmax"
  bottom: "cls_score_242"
  top: "cls_prob_242"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_246"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_246"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_246"
  type: "Softmax"
  bottom: "cls_score_246"
  top: "cls_prob_246"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_247"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_247"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_247"
  type: "Softmax"
  bottom: "cls_score_247"
  top: "cls_prob_247"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_248"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_248"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_248"
  type: "Softmax"
  bottom: "cls_score_248"
  top: "cls_prob_248"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_250"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_250"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_250"
  type: "Softmax"
  bottom: "cls_score_250"
  top: "cls_prob_250"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_253"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_253"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_253"
  type: "Softmax"
  bottom: "cls_score_253"
  top: "cls_prob_253"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_254"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_254"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_254"
  type: "Softmax"
  bottom: "cls_score_254"
  top: "cls_prob_254"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_273"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_273"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_273"
  type: "Softmax"
  bottom: "cls_score_273"
  top: "cls_prob_273"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_279"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_279"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_279"
  type: "Softmax"
