input: "data"
input_shape {
  dim: 1
  dim: 3
  dim: 224  
  dim:224
}

input: "im_info"
input_shape {
  dim: 1
  dim: 3
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  convolution_param {
    num_output: 96
    pad: 3
    kernel_size: 7
    stride: 2
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "norm1"
  type: "LRN"
  bottom: "conv1"
  top: "norm1"
  lrn_param {
    local_size: 3
    alpha: 5e-05
    beta: 0.75
    norm_region: WITHIN_CHANNEL
    engine: CAFFE
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "norm1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 1
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    stride: 2
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "norm2"
  type: "LRN"
  bottom: "conv2"
  top: "norm2"
  lrn_param {
    local_size: 3
    alpha: 5e-05
    beta: 0.75
    norm_region: WITHIN_CHANNEL
    engine: CAFFE
  }
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "norm2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 1
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "conv4"
  top: "conv5"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}
layer {
  name: "rpn_conv/3x3"
  type: "Convolution"
  bottom: "conv5"
  top: "rpn_conv/3x3"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "rpn_relu/3x3"
  type: "ReLU"
  bottom: "rpn_conv/3x3"
  top: "rpn_conv/3x3"
}
layer {
  name: "rpn_cls_score"
  type: "Convolution"
  bottom: "rpn_conv/3x3"
  top: "rpn_cls_score"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  convolution_param {
    num_output: 18
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "rpn_bbox_pred"
  type: "Convolution"
  bottom: "rpn_conv/3x3"
  top: "rpn_bbox_pred"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  convolution_param {
    num_output: 36
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "rpn_cls_score_reshape"
  type: "Reshape"
  bottom: "rpn_cls_score"
  top: "rpn_cls_score_reshape"
  reshape_param {
    shape {
      dim: 0
      dim: 2
      dim: -1
      dim: 0
    }
  }
}
layer {
  name: "rpn_cls_prob"
  type: "Softmax"
  bottom: "rpn_cls_score_reshape"
  top: "rpn_cls_prob"
}
layer {
  name: "rpn_cls_prob_reshape"
  type: "Reshape"
  bottom: "rpn_cls_prob"
  top: "rpn_cls_prob_reshape"
  reshape_param {
    shape {
      dim: 0
      dim: 18
      dim: -1
      dim: 0
    }
  }
}
layer {
  name: "proposal"
  type: "Python"
  bottom: "rpn_cls_prob_reshape"
  bottom: "rpn_bbox_pred"
  bottom: "im_info"
  top: "rois"
  python_param {
    module: "rpn.proposal_layer"
    layer: "ProposalLayer"
    param_str: "\'feat_stride\': 16"
  }
}
layer {
  name: "roi_pool_conv5"
  type: "ROIPooling"
  bottom: "conv5"
  bottom: "rois"
  top: "roi_pool_conv5"
  roi_pooling_param {
    pooled_h: 6
    pooled_w: 6
    spatial_scale: 0.0625
  }
}
layer {
  name: "fc6"
  type: "InnerProduct"
  bottom: "roi_pool_conv5"
  top: "fc6"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4096
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "drop6"
  type: "Dropout"
  bottom: "fc6"
  top: "fc6"
  dropout_param {
    dropout_ratio: 0.5
    scale_train: false
  }
}
layer {
  name: "fc7"
  type: "InnerProduct"
  bottom: "fc6"
  top: "fc7"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4096
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "fc7"
  top: "fc7"
}
layer {
  name: "drop7"
  type: "Dropout"
  bottom: "fc7"
  top: "fc7"
  dropout_param {
    dropout_ratio: 0.5
    scale_train: false
  }
}
layer {
  name: "bbox_pred"
  type: "InnerProduct"
  bottom: "fc7"
  top: "bbox_pred"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 1184
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_score_0"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_0"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_0"
  type: "Softmax"
  bottom: "cls_score_0"
  top: "cls_prob_0"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_1"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_1"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_1"
  type: "Softmax"
  bottom: "cls_score_1"
  top: "cls_prob_1"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_3"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_3"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_3"
  type: "Softmax"
  bottom: "cls_score_3"
  top: "cls_prob_3"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_4"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_4"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_4"
  type: "Softmax"
  bottom: "cls_score_4"
  top: "cls_prob_4"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_5"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_5"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_5"
  type: "Softmax"
  bottom: "cls_score_5"
  top: "cls_prob_5"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_6"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_6"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_6"
  type: "Softmax"
  bottom: "cls_score_6"
  top: "cls_prob_6"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_7"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_7"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_7"
  type: "Softmax"
  bottom: "cls_score_7"
  top: "cls_prob_7"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_8"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_8"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_8"
  type: "Softmax"
  bottom: "cls_score_8"
  top: "cls_prob_8"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_9"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_9"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_9"
  type: "Softmax"
  bottom: "cls_score_9"
  top: "cls_prob_9"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_12"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_12"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_12"
  type: "Softmax"
  bottom: "cls_score_12"
  top: "cls_prob_12"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_13"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_13"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 7
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_13"
  type: "Softmax"
  bottom: "cls_score_13"
  top: "cls_prob_13"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_14"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_14"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_14"
  type: "Softmax"
  bottom: "cls_score_14"
  top: "cls_prob_14"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_15"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_15"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_15"
  type: "Softmax"
  bottom: "cls_score_15"
  top: "cls_prob_15"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_16"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_16"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_16"
  type: "Softmax"
  bottom: "cls_score_16"
  top: "cls_prob_16"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_17"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_17"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_17"
  type: "Softmax"
  bottom: "cls_score_17"
  top: "cls_prob_17"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_18"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_18"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_18"
  type: "Softmax"
  bottom: "cls_score_18"
  top: "cls_prob_18"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_19"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_19"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 5
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_19"
  type: "Softmax"
  bottom: "cls_score_19"
  top: "cls_prob_19"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_20"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_20"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_20"
  type: "Softmax"
  bottom: "cls_score_20"
  top: "cls_prob_20"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_21"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_21"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_21"
  type: "Softmax"
  bottom: "cls_score_21"
  top: "cls_prob_21"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_22"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_22"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 6
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_22"
  type: "Softmax"
  bottom: "cls_score_22"
  top: "cls_prob_22"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_23"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_23"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 8
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_23"
  type: "Softmax"
  bottom: "cls_score_23"
  top: "cls_prob_23"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_24"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_24"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 13
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_24"
  type: "Softmax"
  bottom: "cls_score_24"
  top: "cls_prob_24"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_25"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_25"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_25"
  type: "Softmax"
  bottom: "cls_score_25"
  top: "cls_prob_25"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_26"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_26"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_26"
  type: "Softmax"
  bottom: "cls_score_26"
  top: "cls_prob_26"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_27"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_27"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 6
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_27"
  type: "Softmax"
  bottom: "cls_score_27"
  top: "cls_prob_27"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_28"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_28"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_28"
  type: "Softmax"
  bottom: "cls_score_28"
  top: "cls_prob_28"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_31"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_31"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_31"
  type: "Softmax"
  bottom: "cls_score_31"
  top: "cls_prob_31"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_33"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_33"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 5
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_33"
  type: "Softmax"
  bottom: "cls_score_33"
  top: "cls_prob_33"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_34"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_34"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 7
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_34"
  type: "Softmax"
  bottom: "cls_score_34"
  top: "cls_prob_34"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_35"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_35"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_35"
  type: "Softmax"
  bottom: "cls_score_35"
  top: "cls_prob_35"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_40"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_40"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_40"
  type: "Softmax"
  bottom: "cls_score_40"
  top: "cls_prob_40"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_41"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_41"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_41"
  type: "Softmax"
  bottom: "cls_score_41"
  top: "cls_prob_41"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_43"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_43"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_43"
  type: "Softmax"
  bottom: "cls_score_43"
  top: "cls_prob_43"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_45"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_45"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_45"
  type: "Softmax"
  bottom: "cls_score_45"
  top: "cls_prob_45"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_46"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_46"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_46"
  type: "Softmax"
  bottom: "cls_score_46"
  top: "cls_prob_46"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_47"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_47"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 5
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_47"
  type: "Softmax"
  bottom: "cls_score_47"
  top: "cls_prob_47"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_48"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_48"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_48"
  type: "Softmax"
  bottom: "cls_score_48"
  top: "cls_prob_48"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_54"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_54"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_54"
  type: "Softmax"
  bottom: "cls_score_54"
  top: "cls_prob_54"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_55"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_55"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_55"
  type: "Softmax"
  bottom: "cls_score_55"
  top: "cls_prob_55"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_58"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_58"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_58"
  type: "Softmax"
  bottom: "cls_score_58"
  top: "cls_prob_58"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_59"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_59"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 5
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_59"
  type: "Softmax"
  bottom: "cls_score_59"
  top: "cls_prob_59"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_63"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_63"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_63"
  type: "Softmax"
  bottom: "cls_score_63"
  top: "cls_prob_63"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_68"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_68"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_68"
  type: "Softmax"
  bottom: "cls_score_68"
  top: "cls_prob_68"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_70"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_70"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_70"
  type: "Softmax"
  bottom: "cls_score_70"
  top: "cls_prob_70"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_74"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_74"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_74"
  type: "Softmax"
  bottom: "cls_score_74"
  top: "cls_prob_74"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_77"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_77"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_77"
  type: "Softmax"
  bottom: "cls_score_77"
  top: "cls_prob_77"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_78"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_78"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_78"
  type: "Softmax"
  bottom: "cls_score_78"
  top: "cls_prob_78"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_79"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_79"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_79"
  type: "Softmax"
  bottom: "cls_score_79"
  top: "cls_prob_79"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_83"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_83"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_83"
  type: "Softmax"
  bottom: "cls_score_83"
  top: "cls_prob_83"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_88"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_88"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_88"
  type: "Softmax"
  bottom: "cls_score_88"
  top: "cls_prob_88"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_90"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_90"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_90"
  type: "Softmax"
  bottom: "cls_score_90"
  top: "cls_prob_90"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_91"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_91"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_91"
  type: "Softmax"
  bottom: "cls_score_91"
  top: "cls_prob_91"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_105"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_105"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_105"
  type: "Softmax"
  bottom: "cls_score_105"
  top: "cls_prob_105"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_109"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_109"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_109"
  type: "Softmax"
  bottom: "cls_score_109"
  top: "cls_prob_109"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_111"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_111"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_111"
  type: "Softmax"
  bottom: "cls_score_111"
  top: "cls_prob_111"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_112"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_112"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_112"
  type: "Softmax"
  bottom: "cls_score_112"
  top: "cls_prob_112"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_113"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_113"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_113"
  type: "Softmax"
  bottom: "cls_score_113"
  top: "cls_prob_113"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_115"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_115"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 8
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_115"
  type: "Softmax"
  bottom: "cls_score_115"
  top: "cls_prob_115"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_117"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_117"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_117"
  type: "Softmax"
  bottom: "cls_score_117"
  top: "cls_prob_117"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_124"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_124"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_124"
  type: "Softmax"
  bottom: "cls_score_124"
  top: "cls_prob_124"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_126"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_126"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_126"
  type: "Softmax"
  bottom: "cls_score_126"
  top: "cls_prob_126"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_129"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_129"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_129"
  type: "Softmax"
  bottom: "cls_score_129"
  top: "cls_prob_129"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_130"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_130"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_130"
  type: "Softmax"
  bottom: "cls_score_130"
  top: "cls_prob_130"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_134"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_134"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_134"
  type: "Softmax"
  bottom: "cls_score_134"
  top: "cls_prob_134"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_135"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_135"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_135"
  type: "Softmax"
  bottom: "cls_score_135"
  top: "cls_prob_135"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_142"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_142"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_142"
  type: "Softmax"
  bottom: "cls_score_142"
  top: "cls_prob_142"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_147"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_147"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_147"
  type: "Softmax"
  bottom: "cls_score_147"
  top: "cls_prob_147"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_149"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_149"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_149"
  type: "Softmax"
  bottom: "cls_score_149"
  top: "cls_prob_149"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_152"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_152"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_152"
  type: "Softmax"
  bottom: "cls_score_152"
  top: "cls_prob_152"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_153"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_153"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_153"
  type: "Softmax"
  bottom: "cls_score_153"
  top: "cls_prob_153"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_154"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_154"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_154"
  type: "Softmax"
  bottom: "cls_score_154"
  top: "cls_prob_154"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_155"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_155"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_155"
  type: "Softmax"
  bottom: "cls_score_155"
  top: "cls_prob_155"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_156"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_156"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_156"
  type: "Softmax"
  bottom: "cls_score_156"
  top: "cls_prob_156"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_169"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_169"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_169"
  type: "Softmax"
  bottom: "cls_score_169"
  top: "cls_prob_169"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_176"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_176"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_176"
  type: "Softmax"
  bottom: "cls_score_176"
  top: "cls_prob_176"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_177"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_177"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_177"
  type: "Softmax"
  bottom: "cls_score_177"
  top: "cls_prob_177"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_186"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_186"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_186"
  type: "Softmax"
  bottom: "cls_score_186"
  top: "cls_prob_186"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_193"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_193"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_193"
  type: "Softmax"
  bottom: "cls_score_193"
  top: "cls_prob_193"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_194"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_194"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 5
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_194"
  type: "Softmax"
  bottom: "cls_score_194"
  top: "cls_prob_194"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_195"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_195"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_195"
  type: "Softmax"
  bottom: "cls_score_195"
  top: "cls_prob_195"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_197"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_197"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_197"
  type: "Softmax"
  bottom: "cls_score_197"
  top: "cls_prob_197"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_215"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_215"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_215"
  type: "Softmax"
  bottom: "cls_score_215"
  top: "cls_prob_215"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_225"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_225"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_225"
  type: "Softmax"
  bottom: "cls_score_225"
  top: "cls_prob_225"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_233"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_233"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_233"
  type: "Softmax"
  bottom: "cls_score_233"
  top: "cls_prob_233"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_235"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_235"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_235"
  type: "Softmax"
  bottom: "cls_score_235"
  top: "cls_prob_235"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_243"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_243"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_243"
  type: "Softmax"
  bottom: "cls_score_243"
  top: "cls_prob_243"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_250"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_250"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_250"
  type: "Softmax"
  bottom: "cls_score_250"
  top: "cls_prob_250"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_251"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_251"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_251"
  type: "Softmax"
  bottom: "cls_score_251"
  top: "cls_prob_251"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_253"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_253"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_253"
  type: "Softmax"
  bottom: "cls_score_253"
  top: "cls_prob_253"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_254"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_254"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_254"
  type: "Softmax"
  bottom: "cls_score_254"
  top: "cls_prob_254"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_258"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_258"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_258"
  type: "Softmax"
  bottom: "cls_score_258"
