input: "data"
input_shape {
  dim: 1
  dim: 3
  dim: 224  
  dim:224
}

input: "im_info"
input_shape {
  dim: 1
  dim: 3
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  convolution_param {
    num_output: 96
    pad: 3
    kernel_size: 7
    stride: 2
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "norm1"
  type: "LRN"
  bottom: "conv1"
  top: "norm1"
  lrn_param {
    local_size: 3
    alpha: 5e-05
    beta: 0.75
    norm_region: WITHIN_CHANNEL
    engine: CAFFE
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "norm1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 1
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    stride: 2
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "norm2"
  type: "LRN"
  bottom: "conv2"
  top: "norm2"
  lrn_param {
    local_size: 3
    alpha: 5e-05
    beta: 0.75
    norm_region: WITHIN_CHANNEL
    engine: CAFFE
  }
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "norm2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 1
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "conv4"
  top: "conv5"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}
layer {
  name: "rpn_conv/3x3"
  type: "Convolution"
  bottom: "conv5"
  top: "rpn_conv/3x3"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "rpn_relu/3x3"
  type: "ReLU"
  bottom: "rpn_conv/3x3"
  top: "rpn_conv/3x3"
}
layer {
  name: "rpn_cls_score"
  type: "Convolution"
  bottom: "rpn_conv/3x3"
  top: "rpn_cls_score"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  convolution_param {
    num_output: 18
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "rpn_bbox_pred"
  type: "Convolution"
  bottom: "rpn_conv/3x3"
  top: "rpn_bbox_pred"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  convolution_param {
    num_output: 36
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "rpn_cls_score_reshape"
  type: "Reshape"
  bottom: "rpn_cls_score"
  top: "rpn_cls_score_reshape"
  reshape_param {
    shape {
      dim: 0
      dim: 2
      dim: -1
      dim: 0
    }
  }
}
layer {
  name: "rpn_cls_prob"
  type: "Softmax"
  bottom: "rpn_cls_score_reshape"
  top: "rpn_cls_prob"
}
layer {
  name: "rpn_cls_prob_reshape"
  type: "Reshape"
  bottom: "rpn_cls_prob"
  top: "rpn_cls_prob_reshape"
  reshape_param {
    shape {
      dim: 0
      dim: 18
      dim: -1
      dim: 0
    }
  }
}
layer {
  name: "proposal"
  type: "Python"
  bottom: "rpn_cls_prob_reshape"
  bottom: "rpn_bbox_pred"
  bottom: "im_info"
  top: "rois"
  python_param {
    module: "rpn.proposal_layer"
    layer: "ProposalLayer"
    param_str: "\'feat_stride\': 16"
  }
}
layer {
  name: "roi_pool_conv5"
  type: "ROIPooling"
  bottom: "conv5"
  bottom: "rois"
  top: "roi_pool_conv5"
  roi_pooling_param {
    pooled_h: 6
    pooled_w: 6
    spatial_scale: 0.0625
  }
}
layer {
  name: "fc6"
  type: "InnerProduct"
  bottom: "roi_pool_conv5"
  top: "fc6"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4096
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "drop6"
  type: "Dropout"
  bottom: "fc6"
  top: "fc6"
  dropout_param {
    dropout_ratio: 0.5
    scale_train: false
  }
}
layer {
  name: "fc7"
  type: "InnerProduct"
  bottom: "fc6"
  top: "fc7"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4096
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "fc7"
  top: "fc7"
}
layer {
  name: "drop7"
  type: "Dropout"
  bottom: "fc7"
  top: "fc7"
  dropout_param {
    dropout_ratio: 0.5
    scale_train: false
  }
}
layer {
  name: "bbox_pred"
  type: "InnerProduct"
  bottom: "fc7"
  top: "bbox_pred"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 1184
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_score_0"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_0"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_0"
  type: "Softmax"
  bottom: "cls_score_0"
  top: "cls_prob_0"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_1"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_1"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_1"
  type: "Softmax"
  bottom: "cls_score_1"
  top: "cls_prob_1"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_2"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_2"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_2"
  type: "Softmax"
  bottom: "cls_score_2"
  top: "cls_prob_2"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_4"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_4"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_4"
  type: "Softmax"
  bottom: "cls_score_4"
  top: "cls_prob_4"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_5"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_5"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_5"
  type: "Softmax"
  bottom: "cls_score_5"
  top: "cls_prob_5"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_6"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_6"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_6"
  type: "Softmax"
  bottom: "cls_score_6"
  top: "cls_prob_6"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_7"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_7"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_7"
  type: "Softmax"
  bottom: "cls_score_7"
  top: "cls_prob_7"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_8"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_8"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_8"
  type: "Softmax"
  bottom: "cls_score_8"
  top: "cls_prob_8"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_9"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_9"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_9"
  type: "Softmax"
  bottom: "cls_score_9"
  top: "cls_prob_9"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_12"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_12"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_12"
  type: "Softmax"
  bottom: "cls_score_12"
  top: "cls_prob_12"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_13"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_13"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 7
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_13"
  type: "Softmax"
  bottom: "cls_score_13"
  top: "cls_prob_13"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_14"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_14"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_14"
  type: "Softmax"
  bottom: "cls_score_14"
  top: "cls_prob_14"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_15"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_15"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_15"
  type: "Softmax"
  bottom: "cls_score_15"
  top: "cls_prob_15"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_16"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_16"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_16"
  type: "Softmax"
  bottom: "cls_score_16"
  top: "cls_prob_16"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_17"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_17"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_17"
  type: "Softmax"
  bottom: "cls_score_17"
  top: "cls_prob_17"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_18"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_18"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 5
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_18"
  type: "Softmax"
  bottom: "cls_score_18"
  top: "cls_prob_18"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_19"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_19"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_19"
  type: "Softmax"
  bottom: "cls_score_19"
  top: "cls_prob_19"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_20"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_20"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_20"
  type: "Softmax"
  bottom: "cls_score_20"
  top: "cls_prob_20"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_21"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_21"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_21"
  type: "Softmax"
  bottom: "cls_score_21"
  top: "cls_prob_21"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_22"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_22"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 6
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_22"
  type: "Softmax"
  bottom: "cls_score_22"
  top: "cls_prob_22"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_23"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_23"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 8
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_23"
  type: "Softmax"
  bottom: "cls_score_23"
  top: "cls_prob_23"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_24"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_24"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 13
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_24"
  type: "Softmax"
  bottom: "cls_score_24"
  top: "cls_prob_24"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_25"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_25"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_25"
  type: "Softmax"
  bottom: "cls_score_25"
  top: "cls_prob_25"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_26"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_26"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_26"
  type: "Softmax"
  bottom: "cls_score_26"
  top: "cls_prob_26"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_27"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_27"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_27"
  type: "Softmax"
  bottom: "cls_score_27"
  top: "cls_prob_27"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_28"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_28"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 6
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_28"
  type: "Softmax"
  bottom: "cls_score_28"
  top: "cls_prob_28"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_31"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_31"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_31"
  type: "Softmax"
  bottom: "cls_score_31"
  top: "cls_prob_31"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_33"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_33"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_33"
  type: "Softmax"
  bottom: "cls_score_33"
  top: "cls_prob_33"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_35"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_35"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 7
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_35"
  type: "Softmax"
  bottom: "cls_score_35"
  top: "cls_prob_35"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_36"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_36"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 5
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_36"
  type: "Softmax"
  bottom: "cls_score_36"
  top: "cls_prob_36"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_37"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_37"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_37"
  type: "Softmax"
  bottom: "cls_score_37"
  top: "cls_prob_37"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_39"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_39"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_39"
  type: "Softmax"
  bottom: "cls_score_39"
  top: "cls_prob_39"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_40"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_40"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_40"
  type: "Softmax"
  bottom: "cls_score_40"
  top: "cls_prob_40"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_45"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_45"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_45"
  type: "Softmax"
  bottom: "cls_score_45"
  top: "cls_prob_45"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_47"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_47"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_47"
  type: "Softmax"
  bottom: "cls_score_47"
  top: "cls_prob_47"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_48"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_48"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 5
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_48"
  type: "Softmax"
  bottom: "cls_score_48"
  top: "cls_prob_48"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_49"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_49"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_49"
  type: "Softmax"
  bottom: "cls_score_49"
  top: "cls_prob_49"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_50"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_50"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_50"
  type: "Softmax"
  bottom: "cls_score_50"
  top: "cls_prob_50"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_53"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_53"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_53"
  type: "Softmax"
  bottom: "cls_score_53"
  top: "cls_prob_53"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_58"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_58"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_58"
  type: "Softmax"
  bottom: "cls_score_58"
  top: "cls_prob_58"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_59"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_59"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 5
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_59"
  type: "Softmax"
  bottom: "cls_score_59"
  top: "cls_prob_59"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_63"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_63"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_63"
  type: "Softmax"
  bottom: "cls_score_63"
  top: "cls_prob_63"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_65"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_65"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_65"
  type: "Softmax"
  bottom: "cls_score_65"
  top: "cls_prob_65"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_68"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_68"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_68"
  type: "Softmax"
  bottom: "cls_score_68"
  top: "cls_prob_68"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_76"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_76"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_76"
  type: "Softmax"
  bottom: "cls_score_76"
  top: "cls_prob_76"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_78"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_78"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_78"
  type: "Softmax"
  bottom: "cls_score_78"
  top: "cls_prob_78"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_79"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_79"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_79"
  type: "Softmax"
  bottom: "cls_score_79"
  top: "cls_prob_79"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_80"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_80"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_80"
  type: "Softmax"
  bottom: "cls_score_80"
  top: "cls_prob_80"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_81"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_81"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_81"
  type: "Softmax"
  bottom: "cls_score_81"
  top: "cls_prob_81"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_82"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_82"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_82"
  type: "Softmax"
  bottom: "cls_score_82"
  top: "cls_prob_82"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_86"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_86"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_86"
  type: "Softmax"
  bottom: "cls_score_86"
  top: "cls_prob_86"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_91"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_91"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_91"
  type: "Softmax"
  bottom: "cls_score_91"
  top: "cls_prob_91"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_96"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_96"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_96"
  type: "Softmax"
  bottom: "cls_score_96"
  top: "cls_prob_96"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_103"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_103"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_103"
  type: "Softmax"
  bottom: "cls_score_103"
  top: "cls_prob_103"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_111"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_111"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 8
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_111"
  type: "Softmax"
  bottom: "cls_score_111"
  top: "cls_prob_111"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_113"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_113"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_113"
  type: "Softmax"
  bottom: "cls_score_113"
  top: "cls_prob_113"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_116"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_116"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_116"
  type: "Softmax"
  bottom: "cls_score_116"
  top: "cls_prob_116"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_117"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_117"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_117"
  type: "Softmax"
  bottom: "cls_score_117"
  top: "cls_prob_117"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_119"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_119"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_119"
  type: "Softmax"
  bottom: "cls_score_119"
  top: "cls_prob_119"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_120"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_120"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_120"
  type: "Softmax"
  bottom: "cls_score_120"
  top: "cls_prob_120"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_122"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_122"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_122"
  type: "Softmax"
  bottom: "cls_score_122"
  top: "cls_prob_122"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_125"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_125"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_125"
  type: "Softmax"
  bottom: "cls_score_125"
  top: "cls_prob_125"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_127"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_127"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_127"
  type: "Softmax"
  bottom: "cls_score_127"
  top: "cls_prob_127"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_131"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_131"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_131"
  type: "Softmax"
  bottom: "cls_score_131"
  top: "cls_prob_131"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_132"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_132"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_132"
  type: "Softmax"
  bottom: "cls_score_132"
  top: "cls_prob_132"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_140"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_140"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_140"
  type: "Softmax"
  bottom: "cls_score_140"
  top: "cls_prob_140"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_148"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_148"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_148"
  type: "Softmax"
  bottom: "cls_score_148"
  top: "cls_prob_148"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_149"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_149"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_149"
  type: "Softmax"
  bottom: "cls_score_149"
  top: "cls_prob_149"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_150"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_150"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_150"
  type: "Softmax"
  bottom: "cls_score_150"
  top: "cls_prob_150"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_151"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_151"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_151"
  type: "Softmax"
  bottom: "cls_score_151"
  top: "cls_prob_151"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_152"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_152"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_152"
  type: "Softmax"
  bottom: "cls_score_152"
  top: "cls_prob_152"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_155"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_155"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_155"
  type: "Softmax"
  bottom: "cls_score_155"
  top: "cls_prob_155"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_158"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_158"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_158"
  type: "Softmax"
  bottom: "cls_score_158"
  top: "cls_prob_158"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_159"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_159"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_159"
  type: "Softmax"
  bottom: "cls_score_159"
  top: "cls_prob_159"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_170"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_170"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_170"
  type: "Softmax"
  bottom: "cls_score_170"
  top: "cls_prob_170"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_173"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_173"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_173"
  type: "Softmax"
  bottom: "cls_score_173"
  top: "cls_prob_173"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_184"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_184"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_184"
  type: "Softmax"
  bottom: "cls_score_184"
  top: "cls_prob_184"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_186"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_186"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_186"
  type: "Softmax"
  bottom: "cls_score_186"
  top: "cls_prob_186"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_187"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_187"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_187"
  type: "Softmax"
  bottom: "cls_score_187"
  top: "cls_prob_187"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_188"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_188"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 5
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_188"
  type: "Softmax"
  bottom: "cls_score_188"
  top: "cls_prob_188"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_199"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_199"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_199"
  type: "Softmax"
  bottom: "cls_score_199"
  top: "cls_prob_199"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_215"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_215"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_215"
  type: "Softmax"
  bottom: "cls_score_215"
  top: "cls_prob_215"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_222"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_222"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_222"
  type: "Softmax"
  bottom: "cls_score_222"
  top: "cls_prob_222"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_224"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_224"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_224"
  type: "Softmax"
  bottom: "cls_score_224"
  top: "cls_prob_224"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_226"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_226"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_226"
  type: "Softmax"
  bottom: "cls_score_226"
  top: "cls_prob_226"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_238"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_238"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_238"
  type: "Softmax"
  bottom: "cls_score_238"
  top: "cls_prob_238"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_251"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_251"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_251"
  type: "Softmax"
  bottom: "cls_score_251"
  top: "cls_prob_251"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_252"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_252"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_252"
  type: "Softmax"
  bottom: "cls_score_252"
  top: "cls_prob_252"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_253"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_253"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_253"
  type: "Softmax"
  bottom: "cls_score_253"
  top: "cls_prob_253"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_254"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_254"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_254"
  type: "Softmax"
  bottom: "cls_score_254"
  top: "cls_prob_254"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}
layer {
  name: "cls_score_255"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score_255"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob_255"
  type: "Softmax"
  bottom: "cls_score_255"
